public class Task3 {
    /*
    Задача 3: Да се изведат на екрана всички нечетни числа от -10
до 10
     */

    public static void main(String[] args) {
        for (int x =-9;x<=10;x= x+2){
            System.out.println(x);
        }
    }
}
