public class Task1 {
    /*
    Задача 1: Да се изведат на екрана числата от 1 до 100.
     */

    public static void main(String[] args) {
        for(int x =1;x<=100; x++){
            System.out.println(x);
        }
    }
}
